Revit 2026 API

# TransferringProjectStandardsEventArgs Methods

---

The TransferringProjectStandardsEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from RevitAPIPreEventArgs) |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetExternalItems | Gets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | SetExternalItems |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

TransferringProjectStandardsEventArgs Class

Autodesk.Revit.UI.Events Namespace